app/controllers/photos_controller.rb

  def show
    photo = Photo.find_by(id: params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]